ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151cxx_ca7.h
/*************  Bit definition for DDRCTRL_PCFGWQOS1_1 register  **************/
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos (0U)
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Msk (0x7FFU << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos) /*!< 0x000007FF */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1     DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Msk             /*!< Specifies the timeout value for write transactions in region 0 and 1. */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_0   (0x1U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos)   /*!< 0x00000001 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_1   (0x2U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos)   /*!< 0x00000002 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_2   (0x4U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos)   /*!< 0x00000004 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_3   (0x8U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos)   /*!< 0x00000008 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_4   (0x10U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos)  /*!< 0x00000010 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_5   (0x20U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos)  /*!< 0x00000020 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_6   (0x40U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos)  /*!< 0x00000040 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_7   (0x80U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos)  /*!< 0x00000080 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_8   (0x100U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos) /*!< 0x00000100 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_9   (0x200U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos) /*!< 0x00000200 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_10  (0x400U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT1_Pos) /*!< 0x00000400 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos (16U)
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Msk (0x7FFU << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos) /*!< 0x07FF0000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2     DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Msk             /*!< Specifies the timeout value for write transactions in region 2. */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_0   (0x1U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos)   /*!< 0x00010000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_1   (0x2U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos)   /*!< 0x00020000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_2   (0x4U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos)   /*!< 0x00040000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_3   (0x8U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos)   /*!< 0x00080000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_4   (0x10U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos)  /*!< 0x00100000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_5   (0x20U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos)  /*!< 0x00200000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_6   (0x40U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos)  /*!< 0x00400000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_7   (0x80U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos)  /*!< 0x00800000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_8   (0x100U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos) /*!< 0x01000000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_9   (0x200U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos) /*!< 0x02000000 */
#define DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_10  (0x400U << DDRCTRL_PCFGWQOS1_1_WQOS_MAP_TIMEOUT2_Pos) /*!< 0x04000000 */

/******************************************************************************/
/*                                                                            */
/*                   DDRPERFM block description (DDRPERFM)                    */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for DDRPERFM_CTL register  *****************/
#define DDRPERFM_CTL_START_Pos (0U)
#define DDRPERFM_CTL_START_Msk (0x1U << DDRPERFM_CTL_START_Pos) /*!< 0x00000001 */
#define DDRPERFM_CTL_START     DDRPERFM_CTL_START_Msk           /*!< Start counters which are enabled, the time counter (TCNT) is always enabled. */
#define DDRPERFM_CTL_STOP_Pos  (1U)
#define DDRPERFM_CTL_STOP_Msk  (0x1U << DDRPERFM_CTL_STOP_Pos)  /*!< 0x00000002 */
#define DDRPERFM_CTL_STOP      DDRPERFM_CTL_STOP_Msk            /*!< stop all the counters. */

/*****************  Bit definition for DDRPERFM_CFG register  *****************/
#define DDRPERFM_CFG_EN_Pos  (0U)
#define DDRPERFM_CFG_EN_Msk  (0xFU << DDRPERFM_CFG_EN_Pos)  /*!< 0x0000000F */
#define DDRPERFM_CFG_EN      DDRPERFM_CFG_EN_Msk            /*!< enable counter x (from 0 to 3) */
#define DDRPERFM_CFG_EN_0    (0x1U << DDRPERFM_CFG_EN_Pos)  /*!< 0x00000001 */
#define DDRPERFM_CFG_EN_1    (0x2U << DDRPERFM_CFG_EN_Pos)  /*!< 0x00000002 */
#define DDRPERFM_CFG_EN_2    (0x4U << DDRPERFM_CFG_EN_Pos)  /*!< 0x00000004 */
#define DDRPERFM_CFG_EN_3    (0x8U << DDRPERFM_CFG_EN_Pos)  /*!< 0x00000008 */
#define DDRPERFM_CFG_SEL_Pos (16U)
#define DDRPERFM_CFG_SEL_Msk (0x3U << DDRPERFM_CFG_SEL_Pos) /*!< 0x00030000 */
#define DDRPERFM_CFG_SEL     DDRPERFM_CFG_SEL_Msk           /*!< select set of signals to be monitored (from 0 to 3) (see signal set description in Table 34: DDRPERFM signal sets) and counters to be enabled */
#define DDRPERFM_CFG_SEL_0   (0x1U << DDRPERFM_CFG_SEL_Pos) /*!< 0x00010000 */
#define DDRPERFM_CFG_SEL_1   (0x2U << DDRPERFM_CFG_SEL_Pos) /*!< 0x00020000 */

/***************  Bit definition for DDRPERFM_STATUS register  ****************/
#define DDRPERFM_STATUS_COVF_Pos (0U)
#define DDRPERFM_STATUS_COVF_Msk (0xFU << DDRPERFM_STATUS_COVF_Pos) /*!< 0x0000000F */
#define DDRPERFM_STATUS_COVF     DDRPERFM_STATUS_COVF_Msk           /*!< Counter x Overflow (with x from 0 to 3) */
#define DDRPERFM_STATUS_COVF_0   (0x1U << DDRPERFM_STATUS_COVF_Pos) /*!< 0x00000001 */
#define DDRPERFM_STATUS_COVF_1   (0x2U << DDRPERFM_STATUS_COVF_Pos) /*!< 0x00000002 */
#define DDRPERFM_STATUS_COVF_2   (0x4U << DDRPERFM_STATUS_COVF_Pos) /*!< 0x00000004 */
#define DDRPERFM_STATUS_COVF_3   (0x8U << DDRPERFM_STATUS_COVF_Pos) /*!< 0x00000008 */
#define DDRPERFM_STATUS_BUSY_Pos (16U)
#define DDRPERFM_STATUS_BUSY_Msk (0x1U << DDRPERFM_STATUS_BUSY_Pos) /*!< 0x00010000 */
#define DDRPERFM_STATUS_BUSY     DDRPERFM_STATUS_BUSY_Msk           /*!< Busy Status */
#define DDRPERFM_STATUS_TOVF_Pos (31U)
#define DDRPERFM_STATUS_TOVF_Msk (0x1U << DDRPERFM_STATUS_TOVF_Pos) /*!< 0x80000000 */
#define DDRPERFM_STATUS_TOVF     DDRPERFM_STATUS_TOVF_Msk           /*!< total counter overflow */

/*****************  Bit definition for DDRPERFM_CCR register  *****************/
#define DDRPERFM_CCR_CCLR_Pos (0U)
#define DDRPERFM_CCR_CCLR_Msk (0xFU << DDRPERFM_CCR_CCLR_Pos) /*!< 0x0000000F */
#define DDRPERFM_CCR_CCLR     DDRPERFM_CCR_CCLR_Msk           /*!< counter x Clear (with x from 0 to 3) */
#define DDRPERFM_CCR_CCLR_0   (0x1U << DDRPERFM_CCR_CCLR_Pos) /*!< 0x00000001 */
#define DDRPERFM_CCR_CCLR_1   (0x2U << DDRPERFM_CCR_CCLR_Pos) /*!< 0x00000002 */
#define DDRPERFM_CCR_CCLR_2   (0x4U << DDRPERFM_CCR_CCLR_Pos) /*!< 0x00000004 */
#define DDRPERFM_CCR_CCLR_3   (0x8U << DDRPERFM_CCR_CCLR_Pos) /*!< 0x00000008 */
#define DDRPERFM_CCR_TCLR_Pos (31U)
#define DDRPERFM_CCR_TCLR_Msk (0x1U << DDRPERFM_CCR_TCLR_Pos) /*!< 0x80000000 */
#define DDRPERFM_CCR_TCLR     DDRPERFM_CCR_TCLR_Msk           /*!< time counter clear */

