ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151cxx_ca7.h
/*************  Bit definition for RCC_MC_AHB6LPENSETR register  **************/
#define RCC_MC_AHB6LPENSETR_MDMALPEN_Pos          (0U)
#define RCC_MC_AHB6LPENSETR_MDMALPEN_Msk          (0x1U << RCC_MC_AHB6LPENSETR_MDMALPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_AHB6LPENSETR_MDMALPEN              RCC_MC_AHB6LPENSETR_MDMALPEN_Msk                   /*!< MDMA peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENSETR_GPULPEN_Pos           (5U)
#define RCC_MC_AHB6LPENSETR_GPULPEN_Msk           (0x1U << RCC_MC_AHB6LPENSETR_GPULPEN_Pos)          /*!< 0x00000020 */
#define RCC_MC_AHB6LPENSETR_GPULPEN               RCC_MC_AHB6LPENSETR_GPULPEN_Msk                    /*!< GPU peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENSETR_ETHCKLPEN_Pos         (7U)
#define RCC_MC_AHB6LPENSETR_ETHCKLPEN_Msk         (0x1U << RCC_MC_AHB6LPENSETR_ETHCKLPEN_Pos)        /*!< 0x00000080 */
#define RCC_MC_AHB6LPENSETR_ETHCKLPEN             RCC_MC_AHB6LPENSETR_ETHCKLPEN_Msk                  /*!< Enable of the Ethernet clock generated by the RCC (eth_ker_ck) during CSleep mode */
#define RCC_MC_AHB6LPENSETR_ETHTXLPEN_Pos         (8U)
#define RCC_MC_AHB6LPENSETR_ETHTXLPEN_Msk         (0x1U << RCC_MC_AHB6LPENSETR_ETHTXLPEN_Pos)        /*!< 0x00000100 */
#define RCC_MC_AHB6LPENSETR_ETHTXLPEN             RCC_MC_AHB6LPENSETR_ETHTXLPEN_Msk                  /*!< Enable of the Ethernet Transmission Clock during CSleep mode */
#define RCC_MC_AHB6LPENSETR_ETHRXLPEN_Pos         (9U)
#define RCC_MC_AHB6LPENSETR_ETHRXLPEN_Msk         (0x1U << RCC_MC_AHB6LPENSETR_ETHRXLPEN_Pos)        /*!< 0x00000200 */
#define RCC_MC_AHB6LPENSETR_ETHRXLPEN             RCC_MC_AHB6LPENSETR_ETHRXLPEN_Msk                  /*!< Enable of the Ethernet Reception Clock during CSleep mode */
#define RCC_MC_AHB6LPENSETR_ETHMACLPEN_Pos        (10U)
#define RCC_MC_AHB6LPENSETR_ETHMACLPEN_Msk        (0x1U << RCC_MC_AHB6LPENSETR_ETHMACLPEN_Pos)       /*!< 0x00000400 */
#define RCC_MC_AHB6LPENSETR_ETHMACLPEN            RCC_MC_AHB6LPENSETR_ETHMACLPEN_Msk                 /*!< Enable of the bus interface clocks for ETH block during CSleep mode */
#define RCC_MC_AHB6LPENSETR_ETHSTPEN_Pos          (11U)
#define RCC_MC_AHB6LPENSETR_ETHSTPEN_Msk          (0x1U << RCC_MC_AHB6LPENSETR_ETHSTPEN_Pos)         /*!< 0x00000800 */
#define RCC_MC_AHB6LPENSETR_ETHSTPEN              RCC_MC_AHB6LPENSETR_ETHSTPEN_Msk                   /*!< ETH peripheral clock enable during CStop mode */
#define RCC_MC_AHB6LPENSETR_FMCLPEN_Pos           (12U)
#define RCC_MC_AHB6LPENSETR_FMCLPEN_Msk           (0x1U << RCC_MC_AHB6LPENSETR_FMCLPEN_Pos)          /*!< 0x00001000 */
#define RCC_MC_AHB6LPENSETR_FMCLPEN               RCC_MC_AHB6LPENSETR_FMCLPEN_Msk                    /*!< FMC peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENSETR_QSPILPEN_Pos          (14U)
#define RCC_MC_AHB6LPENSETR_QSPILPEN_Msk          (0x1U << RCC_MC_AHB6LPENSETR_QSPILPEN_Pos)         /*!< 0x00004000 */
#define RCC_MC_AHB6LPENSETR_QSPILPEN              RCC_MC_AHB6LPENSETR_QSPILPEN_Msk                   /*!< QUADSPI peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENSETR_SDMMC1LPEN_Pos        (16U)
#define RCC_MC_AHB6LPENSETR_SDMMC1LPEN_Msk        (0x1U << RCC_MC_AHB6LPENSETR_SDMMC1LPEN_Pos)       /*!< 0x00010000 */
#define RCC_MC_AHB6LPENSETR_SDMMC1LPEN            RCC_MC_AHB6LPENSETR_SDMMC1LPEN_Msk                 /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENSETR_SDMMC2LPEN_Pos        (17U)
#define RCC_MC_AHB6LPENSETR_SDMMC2LPEN_Msk        (0x1U << RCC_MC_AHB6LPENSETR_SDMMC2LPEN_Pos)       /*!< 0x00020000 */
#define RCC_MC_AHB6LPENSETR_SDMMC2LPEN            RCC_MC_AHB6LPENSETR_SDMMC2LPEN_Msk                 /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENSETR_CRC1LPEN_Pos          (20U)
#define RCC_MC_AHB6LPENSETR_CRC1LPEN_Msk          (0x1U << RCC_MC_AHB6LPENSETR_CRC1LPEN_Pos)         /*!< 0x00100000 */
#define RCC_MC_AHB6LPENSETR_CRC1LPEN              RCC_MC_AHB6LPENSETR_CRC1LPEN_Msk                   /*!< CRC1 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENSETR_USBHLPEN_Pos          (24U)
#define RCC_MC_AHB6LPENSETR_USBHLPEN_Msk          (0x1U << RCC_MC_AHB6LPENSETR_USBHLPEN_Pos)         /*!< 0x01000000 */
#define RCC_MC_AHB6LPENSETR_USBHLPEN              RCC_MC_AHB6LPENSETR_USBHLPEN_Msk                   /*!< USBH peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_AHB6LPENCLRR register  **************/
#define RCC_MC_AHB6LPENCLRR_MDMALPEN_Pos          (0U)
#define RCC_MC_AHB6LPENCLRR_MDMALPEN_Msk          (0x1U << RCC_MC_AHB6LPENCLRR_MDMALPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_AHB6LPENCLRR_MDMALPEN              RCC_MC_AHB6LPENCLRR_MDMALPEN_Msk                   /*!< MDMA peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_GPULPEN_Pos           (5U)
#define RCC_MC_AHB6LPENCLRR_GPULPEN_Msk           (0x1U << RCC_MC_AHB6LPENCLRR_GPULPEN_Pos)          /*!< 0x00000020 */
#define RCC_MC_AHB6LPENCLRR_GPULPEN               RCC_MC_AHB6LPENCLRR_GPULPEN_Msk                    /*!< GPU peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_ETHCKLPEN_Pos         (7U)
#define RCC_MC_AHB6LPENCLRR_ETHCKLPEN_Msk         (0x1U << RCC_MC_AHB6LPENCLRR_ETHCKLPEN_Pos)        /*!< 0x00000080 */
#define RCC_MC_AHB6LPENCLRR_ETHCKLPEN             RCC_MC_AHB6LPENCLRR_ETHCKLPEN_Msk                  /*!< Disable of the Ethernet clock generated by the RCC (eth_ker_ck) during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_ETHTXLPEN_Pos         (8U)
#define RCC_MC_AHB6LPENCLRR_ETHTXLPEN_Msk         (0x1U << RCC_MC_AHB6LPENCLRR_ETHTXLPEN_Pos)        /*!< 0x00000100 */
#define RCC_MC_AHB6LPENCLRR_ETHTXLPEN             RCC_MC_AHB6LPENCLRR_ETHTXLPEN_Msk                  /*!< Disable of the Ethernet Transmission Clock during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_ETHRXLPEN_Pos         (9U)
#define RCC_MC_AHB6LPENCLRR_ETHRXLPEN_Msk         (0x1U << RCC_MC_AHB6LPENCLRR_ETHRXLPEN_Pos)        /*!< 0x00000200 */
#define RCC_MC_AHB6LPENCLRR_ETHRXLPEN             RCC_MC_AHB6LPENCLRR_ETHRXLPEN_Msk                  /*!< Disable of the Ethernet Reception Clock during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_ETHMACLPEN_Pos        (10U)
#define RCC_MC_AHB6LPENCLRR_ETHMACLPEN_Msk        (0x1U << RCC_MC_AHB6LPENCLRR_ETHMACLPEN_Pos)       /*!< 0x00000400 */
#define RCC_MC_AHB6LPENCLRR_ETHMACLPEN            RCC_MC_AHB6LPENCLRR_ETHMACLPEN_Msk                 /*!< Disable of the bus interface clocks for ETH block during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_ETHSTPEN_Pos          (11U)
#define RCC_MC_AHB6LPENCLRR_ETHSTPEN_Msk          (0x1U << RCC_MC_AHB6LPENCLRR_ETHSTPEN_Pos)         /*!< 0x00000800 */
#define RCC_MC_AHB6LPENCLRR_ETHSTPEN              RCC_MC_AHB6LPENCLRR_ETHSTPEN_Msk                   /*!< ETH peripheral clock enable during CStop mode */
#define RCC_MC_AHB6LPENCLRR_FMCLPEN_Pos           (12U)
#define RCC_MC_AHB6LPENCLRR_FMCLPEN_Msk           (0x1U << RCC_MC_AHB6LPENCLRR_FMCLPEN_Pos)          /*!< 0x00001000 */
#define RCC_MC_AHB6LPENCLRR_FMCLPEN               RCC_MC_AHB6LPENCLRR_FMCLPEN_Msk                    /*!< FMC peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_QSPILPEN_Pos          (14U)
#define RCC_MC_AHB6LPENCLRR_QSPILPEN_Msk          (0x1U << RCC_MC_AHB6LPENCLRR_QSPILPEN_Pos)         /*!< 0x00004000 */
#define RCC_MC_AHB6LPENCLRR_QSPILPEN              RCC_MC_AHB6LPENCLRR_QSPILPEN_Msk                   /*!< QUADSPI peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_SDMMC1LPEN_Pos        (16U)
#define RCC_MC_AHB6LPENCLRR_SDMMC1LPEN_Msk        (0x1U << RCC_MC_AHB6LPENCLRR_SDMMC1LPEN_Pos)       /*!< 0x00010000 */
#define RCC_MC_AHB6LPENCLRR_SDMMC1LPEN            RCC_MC_AHB6LPENCLRR_SDMMC1LPEN_Msk                 /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_SDMMC2LPEN_Pos        (17U)
#define RCC_MC_AHB6LPENCLRR_SDMMC2LPEN_Msk        (0x1U << RCC_MC_AHB6LPENCLRR_SDMMC2LPEN_Pos)       /*!< 0x00020000 */
#define RCC_MC_AHB6LPENCLRR_SDMMC2LPEN            RCC_MC_AHB6LPENCLRR_SDMMC2LPEN_Msk                 /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_CRC1LPEN_Pos          (20U)
#define RCC_MC_AHB6LPENCLRR_CRC1LPEN_Msk          (0x1U << RCC_MC_AHB6LPENCLRR_CRC1LPEN_Pos)         /*!< 0x00100000 */
#define RCC_MC_AHB6LPENCLRR_CRC1LPEN              RCC_MC_AHB6LPENCLRR_CRC1LPEN_Msk                   /*!< CRC1 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB6LPENCLRR_USBHLPEN_Pos          (24U)
#define RCC_MC_AHB6LPENCLRR_USBHLPEN_Msk          (0x1U << RCC_MC_AHB6LPENCLRR_USBHLPEN_Pos)         /*!< 0x01000000 */
#define RCC_MC_AHB6LPENCLRR_USBHLPEN              RCC_MC_AHB6LPENCLRR_USBHLPEN_Msk                   /*!< USBH peripheral clocks enable during CSleep mode */

/***************  Bit definition for RCC_BR_RSTSCLRR register  ****************/
#define RCC_BR_RSTSCLRR_PORRSTF_Pos               (0U)
#define RCC_BR_RSTSCLRR_PORRSTF_Msk               (0x1U << RCC_BR_RSTSCLRR_PORRSTF_Pos)              /*!< 0x00000001 */
#define RCC_BR_RSTSCLRR_PORRSTF                   RCC_BR_RSTSCLRR_PORRSTF_Msk                        /*!< POR/PDR reset flag */
#define RCC_BR_RSTSCLRR_BORRSTF_Pos               (1U)
#define RCC_BR_RSTSCLRR_BORRSTF_Msk               (0x1U << RCC_BR_RSTSCLRR_BORRSTF_Pos)              /*!< 0x00000002 */
#define RCC_BR_RSTSCLRR_BORRSTF                   RCC_BR_RSTSCLRR_BORRSTF_Msk                        /*!< BOR reset flag */
#define RCC_BR_RSTSCLRR_PADRSTF_Pos               (2U)
#define RCC_BR_RSTSCLRR_PADRSTF_Msk               (0x1U << RCC_BR_RSTSCLRR_PADRSTF_Pos)              /*!< 0x00000004 */
#define RCC_BR_RSTSCLRR_PADRSTF                   RCC_BR_RSTSCLRR_PADRSTF_Msk                        /*!< NRST reset flag */
#define RCC_BR_RSTSCLRR_HCSSRSTF_Pos              (3U)
#define RCC_BR_RSTSCLRR_HCSSRSTF_Msk              (0x1U << RCC_BR_RSTSCLRR_HCSSRSTF_Pos)             /*!< 0x00000008 */
#define RCC_BR_RSTSCLRR_HCSSRSTF                  RCC_BR_RSTSCLRR_HCSSRSTF_Msk                       /*!< HSE CSS reset flag */
#define RCC_BR_RSTSCLRR_VCORERSTF_Pos             (4U)
#define RCC_BR_RSTSCLRR_VCORERSTF_Msk             (0x1U << RCC_BR_RSTSCLRR_VCORERSTF_Pos)            /*!< 0x00000010 */
#define RCC_BR_RSTSCLRR_VCORERSTF                 RCC_BR_RSTSCLRR_VCORERSTF_Msk                      /*!< VDDCORE reset flag */
#define RCC_BR_RSTSCLRR_MPSYSRSTF_Pos             (6U)
#define RCC_BR_RSTSCLRR_MPSYSRSTF_Msk             (0x1U << RCC_BR_RSTSCLRR_MPSYSRSTF_Pos)            /*!< 0x00000040 */
#define RCC_BR_RSTSCLRR_MPSYSRSTF                 RCC_BR_RSTSCLRR_MPSYSRSTF_Msk                      /*!< MPU System reset flag */
#define RCC_BR_RSTSCLRR_MCSYSRSTF_Pos             (7U)
#define RCC_BR_RSTSCLRR_MCSYSRSTF_Msk             (0x1U << RCC_BR_RSTSCLRR_MCSYSRSTF_Pos)            /*!< 0x00000080 */
#define RCC_BR_RSTSCLRR_MCSYSRSTF                 RCC_BR_RSTSCLRR_MCSYSRSTF_Msk                      /*!< MCU System reset flag */
#define RCC_BR_RSTSCLRR_IWDG1RSTF_Pos             (8U)
#define RCC_BR_RSTSCLRR_IWDG1RSTF_Msk             (0x1U << RCC_BR_RSTSCLRR_IWDG1RSTF_Pos)            /*!< 0x00000100 */
#define RCC_BR_RSTSCLRR_IWDG1RSTF                 RCC_BR_RSTSCLRR_IWDG1RSTF_Msk                      /*!< IWDG1 reset flag */
#define RCC_BR_RSTSCLRR_IWDG2RSTF_Pos             (9U)
#define RCC_BR_RSTSCLRR_IWDG2RSTF_Msk             (0x1U << RCC_BR_RSTSCLRR_IWDG2RSTF_Pos)            /*!< 0x00000200 */
#define RCC_BR_RSTSCLRR_IWDG2RSTF                 RCC_BR_RSTSCLRR_IWDG2RSTF_Msk                      /*!< IWDG2 reset flag */
#define RCC_BR_RSTSCLRR_MPUP0RSTF_Pos             (13U)
#define RCC_BR_RSTSCLRR_MPUP0RSTF_Msk             (0x1U << RCC_BR_RSTSCLRR_MPUP0RSTF_Pos)            /*!< 0x00002000 */
#define RCC_BR_RSTSCLRR_MPUP0RSTF                 RCC_BR_RSTSCLRR_MPUP0RSTF_Msk                      /*!< MPU processor 0 reset flag */
#define RCC_BR_RSTSCLRR_MPUP1RSTF_Pos             (14U)
#define RCC_BR_RSTSCLRR_MPUP1RSTF_Msk             (0x1U << RCC_BR_RSTSCLRR_MPUP1RSTF_Pos)            /*!< 0x00004000 */
#define RCC_BR_RSTSCLRR_MPUP1RSTF                 RCC_BR_RSTSCLRR_MPUP1RSTF_Msk                      /*!< MPU processor 1 reset flag */

/***************  Bit definition for RCC_MP_GRSTCSETR register  ***************/
#define RCC_MP_GRSTCSETR_MPSYSRST_Pos             (0U)
#define RCC_MP_GRSTCSETR_MPSYSRST_Msk             (0x1U << RCC_MP_GRSTCSETR_MPSYSRST_Pos)            /*!< 0x00000001 */
#define RCC_MP_GRSTCSETR_MPSYSRST                 RCC_MP_GRSTCSETR_MPSYSRST_Msk                      /*!< System reset */
#define RCC_MP_GRSTCSETR_MCURST_Pos               (1U)
#define RCC_MP_GRSTCSETR_MCURST_Msk               (0x1U << RCC_MP_GRSTCSETR_MCURST_Pos)              /*!< 0x00000002 */
#define RCC_MP_GRSTCSETR_MCURST                   RCC_MP_GRSTCSETR_MCURST_Msk                        /*!< MCU reset */
#define RCC_MP_GRSTCSETR_MPUP0RST_Pos             (4U)
#define RCC_MP_GRSTCSETR_MPUP0RST_Msk             (0x1U << RCC_MP_GRSTCSETR_MPUP0RST_Pos)            /*!< 0x00000010 */
#define RCC_MP_GRSTCSETR_MPUP0RST                 RCC_MP_GRSTCSETR_MPUP0RST_Msk                      /*!< MPU processor 0 reset */
#define RCC_MP_GRSTCSETR_MPUP1RST_Pos             (5U)
#define RCC_MP_GRSTCSETR_MPUP1RST_Msk             (0x1U << RCC_MP_GRSTCSETR_MPUP1RST_Pos)            /*!< 0x00000020 */
#define RCC_MP_GRSTCSETR_MPUP1RST                 RCC_MP_GRSTCSETR_MPUP1RST_Msk                      /*!< MPU processor 1 reset */

/***************  Bit definition for RCC_MP_RSTSCLRR register  ****************/
#define RCC_MP_RSTSCLRR_PORRSTF_Pos               (0U)
#define RCC_MP_RSTSCLRR_PORRSTF_Msk               (0x1U << RCC_MP_RSTSCLRR_PORRSTF_Pos)              /*!< 0x00000001 */
#define RCC_MP_RSTSCLRR_PORRSTF                   RCC_MP_RSTSCLRR_PORRSTF_Msk                        /*!< POR/PDR reset flag */
#define RCC_MP_RSTSCLRR_BORRSTF_Pos               (1U)
#define RCC_MP_RSTSCLRR_BORRSTF_Msk               (0x1U << RCC_MP_RSTSCLRR_BORRSTF_Pos)              /*!< 0x00000002 */
#define RCC_MP_RSTSCLRR_BORRSTF                   RCC_MP_RSTSCLRR_BORRSTF_Msk                        /*!< BOR reset flag */
#define RCC_MP_RSTSCLRR_PADRSTF_Pos               (2U)
#define RCC_MP_RSTSCLRR_PADRSTF_Msk               (0x1U << RCC_MP_RSTSCLRR_PADRSTF_Pos)              /*!< 0x00000004 */
#define RCC_MP_RSTSCLRR_PADRSTF                   RCC_MP_RSTSCLRR_PADRSTF_Msk                        /*!< NRST reset flag */
#define RCC_MP_RSTSCLRR_HCSSRSTF_Pos              (3U)
#define RCC_MP_RSTSCLRR_HCSSRSTF_Msk              (0x1U << RCC_MP_RSTSCLRR_HCSSRSTF_Pos)             /*!< 0x00000008 */
#define RCC_MP_RSTSCLRR_HCSSRSTF                  RCC_MP_RSTSCLRR_HCSSRSTF_Msk                       /*!< HSE CSS reset flag */
#define RCC_MP_RSTSCLRR_VCORERSTF_Pos             (4U)
#define RCC_MP_RSTSCLRR_VCORERSTF_Msk             (0x1U << RCC_MP_RSTSCLRR_VCORERSTF_Pos)            /*!< 0x00000010 */
#define RCC_MP_RSTSCLRR_VCORERSTF                 RCC_MP_RSTSCLRR_VCORERSTF_Msk                      /*!< VDDCORE reset flag */
#define RCC_MP_RSTSCLRR_MPSYSRSTF_Pos             (6U)
#define RCC_MP_RSTSCLRR_MPSYSRSTF_Msk             (0x1U << RCC_MP_RSTSCLRR_MPSYSRSTF_Pos)            /*!< 0x00000040 */
#define RCC_MP_RSTSCLRR_MPSYSRSTF                 RCC_MP_RSTSCLRR_MPSYSRSTF_Msk                      /*!< MPU System reset flag */
#define RCC_MP_RSTSCLRR_MCSYSRSTF_Pos             (7U)
#define RCC_MP_RSTSCLRR_MCSYSRSTF_Msk             (0x1U << RCC_MP_RSTSCLRR_MCSYSRSTF_Pos)            /*!< 0x00000080 */
#define RCC_MP_RSTSCLRR_MCSYSRSTF                 RCC_MP_RSTSCLRR_MCSYSRSTF_Msk                      /*!< MCU System reset flag */
#define RCC_MP_RSTSCLRR_IWDG1RSTF_Pos             (8U)
#define RCC_MP_RSTSCLRR_IWDG1RSTF_Msk             (0x1U << RCC_MP_RSTSCLRR_IWDG1RSTF_Pos)            /*!< 0x00000100 */
#define RCC_MP_RSTSCLRR_IWDG1RSTF                 RCC_MP_RSTSCLRR_IWDG1RSTF_Msk                      /*!< IWDG1 reset flag */
#define RCC_MP_RSTSCLRR_IWDG2RSTF_Pos             (9U)
#define RCC_MP_RSTSCLRR_IWDG2RSTF_Msk             (0x1U << RCC_MP_RSTSCLRR_IWDG2RSTF_Pos)            /*!< 0x00000200 */
#define RCC_MP_RSTSCLRR_IWDG2RSTF                 RCC_MP_RSTSCLRR_IWDG2RSTF_Msk                      /*!< IWDG2 reset flag */
#define RCC_MP_RSTSCLRR_STDBYRSTF_Pos             (11U)
#define RCC_MP_RSTSCLRR_STDBYRSTF_Msk             (0x1U << RCC_MP_RSTSCLRR_STDBYRSTF_Pos)            /*!< 0x00000800 */
#define RCC_MP_RSTSCLRR_STDBYRSTF                 RCC_MP_RSTSCLRR_STDBYRSTF_Msk                      /*!< System Standby reset flag */
#define RCC_MP_RSTSCLRR_CSTDBYRSTF_Pos            (12U)
#define RCC_MP_RSTSCLRR_CSTDBYRSTF_Msk            (0x1U << RCC_MP_RSTSCLRR_CSTDBYRSTF_Pos)           /*!< 0x00001000 */
#define RCC_MP_RSTSCLRR_CSTDBYRSTF                RCC_MP_RSTSCLRR_CSTDBYRSTF_Msk                     /*!< MPU CStandby reset flag */
#define RCC_MP_RSTSCLRR_MPUP0RSTF_Pos             (13U)
#define RCC_MP_RSTSCLRR_MPUP0RSTF_Msk             (0x1U << RCC_MP_RSTSCLRR_MPUP0RSTF_Pos)            /*!< 0x00002000 */
#define RCC_MP_RSTSCLRR_MPUP0RSTF                 RCC_MP_RSTSCLRR_MPUP0RSTF_Msk                      /*!< MPU processor 0 reset flag */
#define RCC_MP_RSTSCLRR_MPUP1RSTF_Pos             (14U)
#define RCC_MP_RSTSCLRR_MPUP1RSTF_Msk             (0x1U << RCC_MP_RSTSCLRR_MPUP1RSTF_Pos)            /*!< 0x00004000 */
#define RCC_MP_RSTSCLRR_MPUP1RSTF                 RCC_MP_RSTSCLRR_MPUP1RSTF_Msk                      /*!< MPU processor 1 reset flag */
#define RCC_MP_RSTSCLRR_SPARE_Pos                 (15U)
#define RCC_MP_RSTSCLRR_SPARE_Msk                 (0x1U << RCC_MP_RSTSCLRR_SPARE_Pos)                /*!< 0x00008000 */
#define RCC_MP_RSTSCLRR_SPARE                     RCC_MP_RSTSCLRR_SPARE_Msk                          /*!< Spare bits */

/**************  Bit definition for RCC_MP_IWDGFZSETR register  ***************/
#define RCC_MP_IWDGFZSETR_FZ_IWDG1_Pos            (0U)
#define RCC_MP_IWDGFZSETR_FZ_IWDG1_Msk            (0x1U << RCC_MP_IWDGFZSETR_FZ_IWDG1_Pos)           /*!< 0x00000001 */
#define RCC_MP_IWDGFZSETR_FZ_IWDG1                RCC_MP_IWDGFZSETR_FZ_IWDG1_Msk                     /*!< Freeze the IWDG1 clock */
#define RCC_MP_IWDGFZSETR_FZ_IWDG2_Pos            (1U)
#define RCC_MP_IWDGFZSETR_FZ_IWDG2_Msk            (0x1U << RCC_MP_IWDGFZSETR_FZ_IWDG2_Pos)           /*!< 0x00000002 */
#define RCC_MP_IWDGFZSETR_FZ_IWDG2                RCC_MP_IWDGFZSETR_FZ_IWDG2_Msk                     /*!< Freeze the IWDG2 clock */

/**************  Bit definition for RCC_MP_IWDGFZCLRR register  ***************/
#define RCC_MP_IWDGFZCLRR_FZ_IWDG1_Pos            (0U)
#define RCC_MP_IWDGFZCLRR_FZ_IWDG1_Msk            (0x1U << RCC_MP_IWDGFZCLRR_FZ_IWDG1_Pos)           /*!< 0x00000001 */
#define RCC_MP_IWDGFZCLRR_FZ_IWDG1                RCC_MP_IWDGFZCLRR_FZ_IWDG1_Msk                     /*!< Unfreeze the IWDG1 clock */
#define RCC_MP_IWDGFZCLRR_FZ_IWDG2_Pos            (1U)
#define RCC_MP_IWDGFZCLRR_FZ_IWDG2_Msk            (0x1U << RCC_MP_IWDGFZCLRR_FZ_IWDG2_Pos)           /*!< 0x00000002 */
#define RCC_MP_IWDGFZCLRR_FZ_IWDG2                RCC_MP_IWDGFZCLRR_FZ_IWDG2_Msk                     /*!< Unfreeze the IWDG2 clock */

/*****************  Bit definition for RCC_MP_CIER register  ******************/
#define RCC_MP_CIER_LSIRDYIE_Pos                  (0U)
#define RCC_MP_CIER_LSIRDYIE_Msk                  (0x1U << RCC_MP_CIER_LSIRDYIE_Pos)                 /*!< 0x00000001 */
#define RCC_MP_CIER_LSIRDYIE                      RCC_MP_CIER_LSIRDYIE_Msk                           /*!< LSI ready Interrupt Enable */
#define RCC_MP_CIER_LSERDYIE_Pos                  (1U)
#define RCC_MP_CIER_LSERDYIE_Msk                  (0x1U << RCC_MP_CIER_LSERDYIE_Pos)                 /*!< 0x00000002 */
#define RCC_MP_CIER_LSERDYIE                      RCC_MP_CIER_LSERDYIE_Msk                           /*!< LSE ready Interrupt Enable */
#define RCC_MP_CIER_HSIRDYIE_Pos                  (2U)
#define RCC_MP_CIER_HSIRDYIE_Msk                  (0x1U << RCC_MP_CIER_HSIRDYIE_Pos)                 /*!< 0x00000004 */
#define RCC_MP_CIER_HSIRDYIE                      RCC_MP_CIER_HSIRDYIE_Msk                           /*!< HSI ready Interrupt Enable */
#define RCC_MP_CIER_HSERDYIE_Pos                  (3U)
#define RCC_MP_CIER_HSERDYIE_Msk                  (0x1U << RCC_MP_CIER_HSERDYIE_Pos)                 /*!< 0x00000008 */
#define RCC_MP_CIER_HSERDYIE                      RCC_MP_CIER_HSERDYIE_Msk                           /*!< HSE ready Interrupt Enable */
#define RCC_MP_CIER_CSIRDYIE_Pos                  (4U)
#define RCC_MP_CIER_CSIRDYIE_Msk                  (0x1U << RCC_MP_CIER_CSIRDYIE_Pos)                 /*!< 0x00000010 */
#define RCC_MP_CIER_CSIRDYIE                      RCC_MP_CIER_CSIRDYIE_Msk                           /*!< CSI ready Interrupt Enable */
#define RCC_MP_CIER_PLL1DYIE_Pos                  (8U)
#define RCC_MP_CIER_PLL1DYIE_Msk                  (0x1U << RCC_MP_CIER_PLL1DYIE_Pos)                 /*!< 0x00000100 */
#define RCC_MP_CIER_PLL1DYIE                      RCC_MP_CIER_PLL1DYIE_Msk                           /*!< PLL1 ready Interrupt Enable */
#define RCC_MP_CIER_PLL2DYIE_Pos                  (9U)
#define RCC_MP_CIER_PLL2DYIE_Msk                  (0x1U << RCC_MP_CIER_PLL2DYIE_Pos)                 /*!< 0x00000200 */
#define RCC_MP_CIER_PLL2DYIE                      RCC_MP_CIER_PLL2DYIE_Msk                           /*!< PLL2 ready Interrupt Enable */
#define RCC_MP_CIER_PLL3DYIE_Pos                  (10U)
#define RCC_MP_CIER_PLL3DYIE_Msk                  (0x1U << RCC_MP_CIER_PLL3DYIE_Pos)                 /*!< 0x00000400 */
#define RCC_MP_CIER_PLL3DYIE                      RCC_MP_CIER_PLL3DYIE_Msk                           /*!< PLL3 ready Interrupt Enable */
#define RCC_MP_CIER_PLL4DYIE_Pos                  (11U)
#define RCC_MP_CIER_PLL4DYIE_Msk                  (0x1U << RCC_MP_CIER_PLL4DYIE_Pos)                 /*!< 0x00000800 */
#define RCC_MP_CIER_PLL4DYIE                      RCC_MP_CIER_PLL4DYIE_Msk                           /*!< PLL4 ready Interrupt Enable */
#define RCC_MP_CIER_LSECSSIE_Pos                  (16U)
#define RCC_MP_CIER_LSECSSIE_Msk                  (0x1U << RCC_MP_CIER_LSECSSIE_Pos)                 /*!< 0x00010000 */
#define RCC_MP_CIER_LSECSSIE                      RCC_MP_CIER_LSECSSIE_Msk                           /*!< LSE clock security system Interrupt Enable */
#define RCC_MP_CIER_WKUPIE_Pos                    (20U)
#define RCC_MP_CIER_WKUPIE_Msk                    (0x1U << RCC_MP_CIER_WKUPIE_Pos)                   /*!< 0x00100000 */
#define RCC_MP_CIER_WKUPIE                        RCC_MP_CIER_WKUPIE_Msk                             /*!< Wake up from CStop Interrupt Enable */

