ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151cxx_ca7.h
/***************  Bit definition for RCC_AHB2RSTCLRR register  ****************/
#define RCC_AHB2RSTCLRR_DMA1RST_Pos               (0U)
#define RCC_AHB2RSTCLRR_DMA1RST_Msk               (0x1U << RCC_AHB2RSTCLRR_DMA1RST_Pos)              /*!< 0x00000001 */
#define RCC_AHB2RSTCLRR_DMA1RST                   RCC_AHB2RSTCLRR_DMA1RST_Msk                        /*!< DMA1 block reset */
#define RCC_AHB2RSTCLRR_DMA2RST_Pos               (1U)
#define RCC_AHB2RSTCLRR_DMA2RST_Msk               (0x1U << RCC_AHB2RSTCLRR_DMA2RST_Pos)              /*!< 0x00000002 */
#define RCC_AHB2RSTCLRR_DMA2RST                   RCC_AHB2RSTCLRR_DMA2RST_Msk                        /*!< DMA2 block reset */
#define RCC_AHB2RSTCLRR_DMAMUXRST_Pos             (2U)
#define RCC_AHB2RSTCLRR_DMAMUXRST_Msk             (0x1U << RCC_AHB2RSTCLRR_DMAMUXRST_Pos)            /*!< 0x00000004 */
#define RCC_AHB2RSTCLRR_DMAMUXRST                 RCC_AHB2RSTCLRR_DMAMUXRST_Msk                      /*!< DMAMUX block reset */
#define RCC_AHB2RSTCLRR_ADC12RST_Pos              (5U)
#define RCC_AHB2RSTCLRR_ADC12RST_Msk              (0x1U << RCC_AHB2RSTCLRR_ADC12RST_Pos)             /*!< 0x00000020 */
#define RCC_AHB2RSTCLRR_ADC12RST                  RCC_AHB2RSTCLRR_ADC12RST_Msk                       /*!< ADC1&amp;2 block reset */
#define RCC_AHB2RSTCLRR_USBORST_Pos               (8U)
#define RCC_AHB2RSTCLRR_USBORST_Msk               (0x1U << RCC_AHB2RSTCLRR_USBORST_Pos)              /*!< 0x00000100 */
#define RCC_AHB2RSTCLRR_USBORST                   RCC_AHB2RSTCLRR_USBORST_Msk                        /*!< USBO block reset */
#define RCC_AHB2RSTCLRR_SDMMC3RST_Pos             (16U)
#define RCC_AHB2RSTCLRR_SDMMC3RST_Msk             (0x1U << RCC_AHB2RSTCLRR_SDMMC3RST_Pos)            /*!< 0x00010000 */
#define RCC_AHB2RSTCLRR_SDMMC3RST                 RCC_AHB2RSTCLRR_SDMMC3RST_Msk                      /*!< SDMMC3 and the SDMMC3 delay (DLYBSD3) block reset */

/***************  Bit definition for RCC_AHB3RSTSETR register  ****************/
#define RCC_AHB3RSTSETR_DCMIRST_Pos               (0U)
#define RCC_AHB3RSTSETR_DCMIRST_Msk               (0x1U << RCC_AHB3RSTSETR_DCMIRST_Pos)              /*!< 0x00000001 */
#define RCC_AHB3RSTSETR_DCMIRST                   RCC_AHB3RSTSETR_DCMIRST_Msk                        /*!< DCMI block reset */
#define RCC_AHB3RSTSETR_CRYP2RST_Pos              (4U)
#define RCC_AHB3RSTSETR_CRYP2RST_Msk              (0x1U << RCC_AHB3RSTSETR_CRYP2RST_Pos)             /*!< 0x00000010 */
#define RCC_AHB3RSTSETR_CRYP2RST                  RCC_AHB3RSTSETR_CRYP2RST_Msk                       /*!< CRYP2 (3DES/AES2) block reset */
#define RCC_AHB3RSTSETR_HASH2RST_Pos              (5U)
#define RCC_AHB3RSTSETR_HASH2RST_Msk              (0x1U << RCC_AHB3RSTSETR_HASH2RST_Pos)             /*!< 0x00000020 */
#define RCC_AHB3RSTSETR_HASH2RST                  RCC_AHB3RSTSETR_HASH2RST_Msk                       /*!< HASH2 block reset */
#define RCC_AHB3RSTSETR_RNG2RST_Pos               (6U)
#define RCC_AHB3RSTSETR_RNG2RST_Msk               (0x1U << RCC_AHB3RSTSETR_RNG2RST_Pos)              /*!< 0x00000040 */
#define RCC_AHB3RSTSETR_RNG2RST                   RCC_AHB3RSTSETR_RNG2RST_Msk                        /*!< RNG2 block reset */
#define RCC_AHB3RSTSETR_CRC2RST_Pos               (7U)
#define RCC_AHB3RSTSETR_CRC2RST_Msk               (0x1U << RCC_AHB3RSTSETR_CRC2RST_Pos)              /*!< 0x00000080 */
#define RCC_AHB3RSTSETR_CRC2RST                   RCC_AHB3RSTSETR_CRC2RST_Msk                        /*!< CRC2 block reset */
#define RCC_AHB3RSTSETR_HSEMRST_Pos               (11U)
#define RCC_AHB3RSTSETR_HSEMRST_Msk               (0x1U << RCC_AHB3RSTSETR_HSEMRST_Pos)              /*!< 0x00000800 */
#define RCC_AHB3RSTSETR_HSEMRST                   RCC_AHB3RSTSETR_HSEMRST_Msk                        /*!< HSEM block reset */
#define RCC_AHB3RSTSETR_IPCCRST_Pos               (12U)
#define RCC_AHB3RSTSETR_IPCCRST_Msk               (0x1U << RCC_AHB3RSTSETR_IPCCRST_Pos)              /*!< 0x00001000 */
#define RCC_AHB3RSTSETR_IPCCRST                   RCC_AHB3RSTSETR_IPCCRST_Msk                        /*!< IPCC block reset */

/***************  Bit definition for RCC_AHB3RSTCLRR register  ****************/
#define RCC_AHB3RSTCLRR_DCMIRST_Pos               (0U)
#define RCC_AHB3RSTCLRR_DCMIRST_Msk               (0x1U << RCC_AHB3RSTCLRR_DCMIRST_Pos)              /*!< 0x00000001 */
#define RCC_AHB3RSTCLRR_DCMIRST                   RCC_AHB3RSTCLRR_DCMIRST_Msk                        /*!< DCMI block reset */
#define RCC_AHB3RSTCLRR_CRYP2RST_Pos              (4U)
#define RCC_AHB3RSTCLRR_CRYP2RST_Msk              (0x1U << RCC_AHB3RSTCLRR_CRYP2RST_Pos)             /*!< 0x00000010 */
#define RCC_AHB3RSTCLRR_CRYP2RST                  RCC_AHB3RSTCLRR_CRYP2RST_Msk                       /*!< CRYP2 (3DES/AES2) block reset */
#define RCC_AHB3RSTCLRR_HASH2RST_Pos              (5U)
#define RCC_AHB3RSTCLRR_HASH2RST_Msk              (0x1U << RCC_AHB3RSTCLRR_HASH2RST_Pos)             /*!< 0x00000020 */
#define RCC_AHB3RSTCLRR_HASH2RST                  RCC_AHB3RSTCLRR_HASH2RST_Msk                       /*!< HASH2 block reset */
#define RCC_AHB3RSTCLRR_RNG2RST_Pos               (6U)
#define RCC_AHB3RSTCLRR_RNG2RST_Msk               (0x1U << RCC_AHB3RSTCLRR_RNG2RST_Pos)              /*!< 0x00000040 */
#define RCC_AHB3RSTCLRR_RNG2RST                   RCC_AHB3RSTCLRR_RNG2RST_Msk                        /*!< RNG2 block reset */
#define RCC_AHB3RSTCLRR_CRC2RST_Pos               (7U)
#define RCC_AHB3RSTCLRR_CRC2RST_Msk               (0x1U << RCC_AHB3RSTCLRR_CRC2RST_Pos)              /*!< 0x00000080 */
#define RCC_AHB3RSTCLRR_CRC2RST                   RCC_AHB3RSTCLRR_CRC2RST_Msk                        /*!< CRC2 block reset */
#define RCC_AHB3RSTCLRR_HSEMRST_Pos               (11U)
#define RCC_AHB3RSTCLRR_HSEMRST_Msk               (0x1U << RCC_AHB3RSTCLRR_HSEMRST_Pos)              /*!< 0x00000800 */
#define RCC_AHB3RSTCLRR_HSEMRST                   RCC_AHB3RSTCLRR_HSEMRST_Msk                        /*!< HSEM block reset */
#define RCC_AHB3RSTCLRR_IPCCRST_Pos               (12U)
#define RCC_AHB3RSTCLRR_IPCCRST_Msk               (0x1U << RCC_AHB3RSTCLRR_IPCCRST_Pos)              /*!< 0x00001000 */
#define RCC_AHB3RSTCLRR_IPCCRST                   RCC_AHB3RSTCLRR_IPCCRST_Msk                        /*!< IPCC block reset */

/***************  Bit definition for RCC_AHB4RSTSETR register  ****************/
#define RCC_AHB4RSTSETR_GPIOARST_Pos              (0U)
#define RCC_AHB4RSTSETR_GPIOARST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIOARST_Pos)             /*!< 0x00000001 */
#define RCC_AHB4RSTSETR_GPIOARST                  RCC_AHB4RSTSETR_GPIOARST_Msk                       /*!< GPIOA block reset */
#define RCC_AHB4RSTSETR_GPIOBRST_Pos              (1U)
#define RCC_AHB4RSTSETR_GPIOBRST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIOBRST_Pos)             /*!< 0x00000002 */
#define RCC_AHB4RSTSETR_GPIOBRST                  RCC_AHB4RSTSETR_GPIOBRST_Msk                       /*!< GPIOB block reset */
#define RCC_AHB4RSTSETR_GPIOCRST_Pos              (2U)
#define RCC_AHB4RSTSETR_GPIOCRST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIOCRST_Pos)             /*!< 0x00000004 */
#define RCC_AHB4RSTSETR_GPIOCRST                  RCC_AHB4RSTSETR_GPIOCRST_Msk                       /*!< GPIOC block reset */
#define RCC_AHB4RSTSETR_GPIODRST_Pos              (3U)
#define RCC_AHB4RSTSETR_GPIODRST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIODRST_Pos)             /*!< 0x00000008 */
#define RCC_AHB4RSTSETR_GPIODRST                  RCC_AHB4RSTSETR_GPIODRST_Msk                       /*!< GPIOD block reset */
#define RCC_AHB4RSTSETR_GPIOERST_Pos              (4U)
#define RCC_AHB4RSTSETR_GPIOERST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIOERST_Pos)             /*!< 0x00000010 */
#define RCC_AHB4RSTSETR_GPIOERST                  RCC_AHB4RSTSETR_GPIOERST_Msk                       /*!< GPIOE block reset */
#define RCC_AHB4RSTSETR_GPIOFRST_Pos              (5U)
#define RCC_AHB4RSTSETR_GPIOFRST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIOFRST_Pos)             /*!< 0x00000020 */
#define RCC_AHB4RSTSETR_GPIOFRST                  RCC_AHB4RSTSETR_GPIOFRST_Msk                       /*!< GPIOF block reset */
#define RCC_AHB4RSTSETR_GPIOGRST_Pos              (6U)
#define RCC_AHB4RSTSETR_GPIOGRST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIOGRST_Pos)             /*!< 0x00000040 */
#define RCC_AHB4RSTSETR_GPIOGRST                  RCC_AHB4RSTSETR_GPIOGRST_Msk                       /*!< GPIOG block reset */
#define RCC_AHB4RSTSETR_GPIOHRST_Pos              (7U)
#define RCC_AHB4RSTSETR_GPIOHRST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIOHRST_Pos)             /*!< 0x00000080 */
#define RCC_AHB4RSTSETR_GPIOHRST                  RCC_AHB4RSTSETR_GPIOHRST_Msk                       /*!< GPIOH block reset */
#define RCC_AHB4RSTSETR_GPIOIRST_Pos              (8U)
#define RCC_AHB4RSTSETR_GPIOIRST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIOIRST_Pos)             /*!< 0x00000100 */
#define RCC_AHB4RSTSETR_GPIOIRST                  RCC_AHB4RSTSETR_GPIOIRST_Msk                       /*!< GPIOI block reset */
#define RCC_AHB4RSTSETR_GPIOJRST_Pos              (9U)
#define RCC_AHB4RSTSETR_GPIOJRST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIOJRST_Pos)             /*!< 0x00000200 */
#define RCC_AHB4RSTSETR_GPIOJRST                  RCC_AHB4RSTSETR_GPIOJRST_Msk                       /*!< GPIOJ block reset */
#define RCC_AHB4RSTSETR_GPIOKRST_Pos              (10U)
#define RCC_AHB4RSTSETR_GPIOKRST_Msk              (0x1U << RCC_AHB4RSTSETR_GPIOKRST_Pos)             /*!< 0x00000400 */
#define RCC_AHB4RSTSETR_GPIOKRST                  RCC_AHB4RSTSETR_GPIOKRST_Msk                       /*!< GPIOK block reset */

/***************  Bit definition for RCC_AHB4RSTCLRR register  ****************/
#define RCC_AHB4RSTCLRR_GPIOARST_Pos              (0U)
#define RCC_AHB4RSTCLRR_GPIOARST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIOARST_Pos)             /*!< 0x00000001 */
#define RCC_AHB4RSTCLRR_GPIOARST                  RCC_AHB4RSTCLRR_GPIOARST_Msk                       /*!< GPIOA block reset */
#define RCC_AHB4RSTCLRR_GPIOBRST_Pos              (1U)
#define RCC_AHB4RSTCLRR_GPIOBRST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIOBRST_Pos)             /*!< 0x00000002 */
#define RCC_AHB4RSTCLRR_GPIOBRST                  RCC_AHB4RSTCLRR_GPIOBRST_Msk                       /*!< GPIOB block reset */
#define RCC_AHB4RSTCLRR_GPIOCRST_Pos              (2U)
#define RCC_AHB4RSTCLRR_GPIOCRST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIOCRST_Pos)             /*!< 0x00000004 */
#define RCC_AHB4RSTCLRR_GPIOCRST                  RCC_AHB4RSTCLRR_GPIOCRST_Msk                       /*!< GPIOC block reset */
#define RCC_AHB4RSTCLRR_GPIODRST_Pos              (3U)
#define RCC_AHB4RSTCLRR_GPIODRST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIODRST_Pos)             /*!< 0x00000008 */
#define RCC_AHB4RSTCLRR_GPIODRST                  RCC_AHB4RSTCLRR_GPIODRST_Msk                       /*!< GPIOD block reset */
#define RCC_AHB4RSTCLRR_GPIOERST_Pos              (4U)
#define RCC_AHB4RSTCLRR_GPIOERST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIOERST_Pos)             /*!< 0x00000010 */
#define RCC_AHB4RSTCLRR_GPIOERST                  RCC_AHB4RSTCLRR_GPIOERST_Msk                       /*!< GPIOE block reset */
#define RCC_AHB4RSTCLRR_GPIOFRST_Pos              (5U)
#define RCC_AHB4RSTCLRR_GPIOFRST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIOFRST_Pos)             /*!< 0x00000020 */
#define RCC_AHB4RSTCLRR_GPIOFRST                  RCC_AHB4RSTCLRR_GPIOFRST_Msk                       /*!< GPIOF block reset */
#define RCC_AHB4RSTCLRR_GPIOGRST_Pos              (6U)
#define RCC_AHB4RSTCLRR_GPIOGRST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIOGRST_Pos)             /*!< 0x00000040 */
#define RCC_AHB4RSTCLRR_GPIOGRST                  RCC_AHB4RSTCLRR_GPIOGRST_Msk                       /*!< GPIOG block reset */
#define RCC_AHB4RSTCLRR_GPIOHRST_Pos              (7U)
#define RCC_AHB4RSTCLRR_GPIOHRST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIOHRST_Pos)             /*!< 0x00000080 */
#define RCC_AHB4RSTCLRR_GPIOHRST                  RCC_AHB4RSTCLRR_GPIOHRST_Msk                       /*!< GPIOH block reset */
#define RCC_AHB4RSTCLRR_GPIOIRST_Pos              (8U)
#define RCC_AHB4RSTCLRR_GPIOIRST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIOIRST_Pos)             /*!< 0x00000100 */
#define RCC_AHB4RSTCLRR_GPIOIRST                  RCC_AHB4RSTCLRR_GPIOIRST_Msk                       /*!< GPIOI block reset */
#define RCC_AHB4RSTCLRR_GPIOJRST_Pos              (9U)
#define RCC_AHB4RSTCLRR_GPIOJRST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIOJRST_Pos)             /*!< 0x00000200 */
#define RCC_AHB4RSTCLRR_GPIOJRST                  RCC_AHB4RSTCLRR_GPIOJRST_Msk                       /*!< GPIOJ block reset */
#define RCC_AHB4RSTCLRR_GPIOKRST_Pos              (10U)
#define RCC_AHB4RSTCLRR_GPIOKRST_Msk              (0x1U << RCC_AHB4RSTCLRR_GPIOKRST_Pos)             /*!< 0x00000400 */
#define RCC_AHB4RSTCLRR_GPIOKRST                  RCC_AHB4RSTCLRR_GPIOKRST_Msk                       /*!< GPIOK block reset */

/**************  Bit definition for RCC_MP_APB1ENSETR register  ***************/
#define RCC_MP_APB1ENSETR_TIM2EN_Pos              (0U)
#define RCC_MP_APB1ENSETR_TIM2EN_Msk              (0x1U << RCC_MP_APB1ENSETR_TIM2EN_Pos)             /*!< 0x00000001 */
#define RCC_MP_APB1ENSETR_TIM2EN                  RCC_MP_APB1ENSETR_TIM2EN_Msk                       /*!< TIM2 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_TIM3EN_Pos              (1U)
#define RCC_MP_APB1ENSETR_TIM3EN_Msk              (0x1U << RCC_MP_APB1ENSETR_TIM3EN_Pos)             /*!< 0x00000002 */
#define RCC_MP_APB1ENSETR_TIM3EN                  RCC_MP_APB1ENSETR_TIM3EN_Msk                       /*!< TIM3 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_TIM4EN_Pos              (2U)
#define RCC_MP_APB1ENSETR_TIM4EN_Msk              (0x1U << RCC_MP_APB1ENSETR_TIM4EN_Pos)             /*!< 0x00000004 */
#define RCC_MP_APB1ENSETR_TIM4EN                  RCC_MP_APB1ENSETR_TIM4EN_Msk                       /*!< TIM4 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_TIM5EN_Pos              (3U)
#define RCC_MP_APB1ENSETR_TIM5EN_Msk              (0x1U << RCC_MP_APB1ENSETR_TIM5EN_Pos)             /*!< 0x00000008 */
#define RCC_MP_APB1ENSETR_TIM5EN                  RCC_MP_APB1ENSETR_TIM5EN_Msk                       /*!< TIM5 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_TIM6EN_Pos              (4U)
#define RCC_MP_APB1ENSETR_TIM6EN_Msk              (0x1U << RCC_MP_APB1ENSETR_TIM6EN_Pos)             /*!< 0x00000010 */
#define RCC_MP_APB1ENSETR_TIM6EN                  RCC_MP_APB1ENSETR_TIM6EN_Msk                       /*!< TIM6 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_TIM7EN_Pos              (5U)
#define RCC_MP_APB1ENSETR_TIM7EN_Msk              (0x1U << RCC_MP_APB1ENSETR_TIM7EN_Pos)             /*!< 0x00000020 */
#define RCC_MP_APB1ENSETR_TIM7EN                  RCC_MP_APB1ENSETR_TIM7EN_Msk                       /*!< TIM7 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_TIM12EN_Pos             (6U)
#define RCC_MP_APB1ENSETR_TIM12EN_Msk             (0x1U << RCC_MP_APB1ENSETR_TIM12EN_Pos)            /*!< 0x00000040 */
#define RCC_MP_APB1ENSETR_TIM12EN                 RCC_MP_APB1ENSETR_TIM12EN_Msk                      /*!< TIM12 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_TIM13EN_Pos             (7U)
#define RCC_MP_APB1ENSETR_TIM13EN_Msk             (0x1U << RCC_MP_APB1ENSETR_TIM13EN_Pos)            /*!< 0x00000080 */
#define RCC_MP_APB1ENSETR_TIM13EN                 RCC_MP_APB1ENSETR_TIM13EN_Msk                      /*!< TIM13 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_TIM14EN_Pos             (8U)
#define RCC_MP_APB1ENSETR_TIM14EN_Msk             (0x1U << RCC_MP_APB1ENSETR_TIM14EN_Pos)            /*!< 0x00000100 */
#define RCC_MP_APB1ENSETR_TIM14EN                 RCC_MP_APB1ENSETR_TIM14EN_Msk                      /*!< TIM14 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_LPTIM1EN_Pos            (9U)
#define RCC_MP_APB1ENSETR_LPTIM1EN_Msk            (0x1U << RCC_MP_APB1ENSETR_LPTIM1EN_Pos)           /*!< 0x00000200 */
#define RCC_MP_APB1ENSETR_LPTIM1EN                RCC_MP_APB1ENSETR_LPTIM1EN_Msk                     /*!< LPTIM1 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_SPI2EN_Pos              (11U)
#define RCC_MP_APB1ENSETR_SPI2EN_Msk              (0x1U << RCC_MP_APB1ENSETR_SPI2EN_Pos)             /*!< 0x00000800 */
#define RCC_MP_APB1ENSETR_SPI2EN                  RCC_MP_APB1ENSETR_SPI2EN_Msk                       /*!< SPI2 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_SPI3EN_Pos              (12U)
#define RCC_MP_APB1ENSETR_SPI3EN_Msk              (0x1U << RCC_MP_APB1ENSETR_SPI3EN_Pos)             /*!< 0x00001000 */
#define RCC_MP_APB1ENSETR_SPI3EN                  RCC_MP_APB1ENSETR_SPI3EN_Msk                       /*!< SPI3 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_USART2EN_Pos            (14U)
#define RCC_MP_APB1ENSETR_USART2EN_Msk            (0x1U << RCC_MP_APB1ENSETR_USART2EN_Pos)           /*!< 0x00004000 */
#define RCC_MP_APB1ENSETR_USART2EN                RCC_MP_APB1ENSETR_USART2EN_Msk                     /*!< USART2 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_USART3EN_Pos            (15U)
#define RCC_MP_APB1ENSETR_USART3EN_Msk            (0x1U << RCC_MP_APB1ENSETR_USART3EN_Pos)           /*!< 0x00008000 */
#define RCC_MP_APB1ENSETR_USART3EN                RCC_MP_APB1ENSETR_USART3EN_Msk                     /*!< USART3 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_UART4EN_Pos             (16U)
#define RCC_MP_APB1ENSETR_UART4EN_Msk             (0x1U << RCC_MP_APB1ENSETR_UART4EN_Pos)            /*!< 0x00010000 */
#define RCC_MP_APB1ENSETR_UART4EN                 RCC_MP_APB1ENSETR_UART4EN_Msk                      /*!< UART4 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_UART5EN_Pos             (17U)
#define RCC_MP_APB1ENSETR_UART5EN_Msk             (0x1U << RCC_MP_APB1ENSETR_UART5EN_Pos)            /*!< 0x00020000 */
#define RCC_MP_APB1ENSETR_UART5EN                 RCC_MP_APB1ENSETR_UART5EN_Msk                      /*!< UART5 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_UART7EN_Pos             (18U)
#define RCC_MP_APB1ENSETR_UART7EN_Msk             (0x1U << RCC_MP_APB1ENSETR_UART7EN_Pos)            /*!< 0x00040000 */
#define RCC_MP_APB1ENSETR_UART7EN                 RCC_MP_APB1ENSETR_UART7EN_Msk                      /*!< UART7 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_UART8EN_Pos             (19U)
#define RCC_MP_APB1ENSETR_UART8EN_Msk             (0x1U << RCC_MP_APB1ENSETR_UART8EN_Pos)            /*!< 0x00080000 */
#define RCC_MP_APB1ENSETR_UART8EN                 RCC_MP_APB1ENSETR_UART8EN_Msk                      /*!< UART8 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_I2C1EN_Pos              (21U)
#define RCC_MP_APB1ENSETR_I2C1EN_Msk              (0x1U << RCC_MP_APB1ENSETR_I2C1EN_Pos)             /*!< 0x00200000 */
#define RCC_MP_APB1ENSETR_I2C1EN                  RCC_MP_APB1ENSETR_I2C1EN_Msk                       /*!< I2C1 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_I2C2EN_Pos              (22U)
#define RCC_MP_APB1ENSETR_I2C2EN_Msk              (0x1U << RCC_MP_APB1ENSETR_I2C2EN_Pos)             /*!< 0x00400000 */
#define RCC_MP_APB1ENSETR_I2C2EN                  RCC_MP_APB1ENSETR_I2C2EN_Msk                       /*!< I2C2 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_I2C3EN_Pos              (23U)
#define RCC_MP_APB1ENSETR_I2C3EN_Msk              (0x1U << RCC_MP_APB1ENSETR_I2C3EN_Pos)             /*!< 0x00800000 */
#define RCC_MP_APB1ENSETR_I2C3EN                  RCC_MP_APB1ENSETR_I2C3EN_Msk                       /*!< I2C3 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_I2C5EN_Pos              (24U)
#define RCC_MP_APB1ENSETR_I2C5EN_Msk              (0x1U << RCC_MP_APB1ENSETR_I2C5EN_Pos)             /*!< 0x01000000 */
#define RCC_MP_APB1ENSETR_I2C5EN                  RCC_MP_APB1ENSETR_I2C5EN_Msk                       /*!< I2C5 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_SPDIFEN_Pos             (26U)
#define RCC_MP_APB1ENSETR_SPDIFEN_Msk             (0x1U << RCC_MP_APB1ENSETR_SPDIFEN_Pos)            /*!< 0x04000000 */
#define RCC_MP_APB1ENSETR_SPDIFEN                 RCC_MP_APB1ENSETR_SPDIFEN_Msk                      /*!< SPDIFRX peripheral clocks enable */
#define RCC_MP_APB1ENSETR_CECEN_Pos               (27U)
#define RCC_MP_APB1ENSETR_CECEN_Msk               (0x1U << RCC_MP_APB1ENSETR_CECEN_Pos)              /*!< 0x08000000 */
#define RCC_MP_APB1ENSETR_CECEN                   RCC_MP_APB1ENSETR_CECEN_Msk                        /*!< HDMI-CEC peripheral clocks enable */
#define RCC_MP_APB1ENSETR_DAC12EN_Pos             (29U)
#define RCC_MP_APB1ENSETR_DAC12EN_Msk             (0x1U << RCC_MP_APB1ENSETR_DAC12EN_Pos)            /*!< 0x20000000 */
#define RCC_MP_APB1ENSETR_DAC12EN                 RCC_MP_APB1ENSETR_DAC12EN_Msk                      /*!< DAC1&amp;2 peripheral clocks enable */
#define RCC_MP_APB1ENSETR_MDIOSEN_Pos             (31U)
#define RCC_MP_APB1ENSETR_MDIOSEN_Msk             (0x1U << RCC_MP_APB1ENSETR_MDIOSEN_Pos)            /*!< 0x80000000 */
#define RCC_MP_APB1ENSETR_MDIOSEN                 RCC_MP_APB1ENSETR_MDIOSEN_Msk                      /*!< MDIOS peripheral clocks enable */

